Repository: abubeker0/salam
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: am, ar, or

source: ❌ Chapa's response was unreadable. Please try again later.
am: ❌ የቻፓ ምላሽ ሊነበብ አልቻለም። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ استجابة Chapa غير مقروءة. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Deebii Chapa dubbisuu hin dandeenye. Itti deebi’i yeroo biraa.

source: ⚠ Payment prepared, but failed to save record. Please contact support.
am: ⚠ ክፍያ ተዘጋጅቷል፣ ነገር ግን መዝገብ ማስቀመጥ አልተቻለም። እባክዎ ድጋፍን ያግኙ።
ar: ⚠ تم تجهيز الدفع، ولكن فشل حفظ السجل. يرجى الاتصال بالدعم.
or: ⚠ Kaffaltiin qophaa’eera, garuu galmee olkaa’uu dadhabe. Deeggarsa qunnami.

source: ✅ Pay with Chapa
am: ✅ በቻፓ ይክፈሉ
ar: ✅ الدفع باستخدام Chapa
or: ✅ Chapa waliin kaffali

source: 💳 Click below to complete your payment securely:
am: 💳 ክፍያዎን በአስተማማኝ ሁኔታ ለማጠናቀቅ ከታች ይጫኑ:
ar: 💳 انقر أدناه لإتمام دفعك بأمان:
or: 💳 Kaffaltii kee nageenyaan xumuruuf gadii tuqi:

source: ❌ Failed to create payment. Please try again later.
am: ❌ ክፍያ መፍጠር አልተቻለም። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ فشل في إنشاء الدفع. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Kaffaltii uumuun hin milkoofne. Itti deebi’i yeroo biraa.

source: ❌ Network error during payment initiation. Please check your connection and try again.
am: ❌ ክፍያ በሚጀምሩበት ጊዜ የአውታረ መረብ ስህተት። እባክዎ ግንኙነትዎን ያረጋግጡ እና እንደገና ይሞክሩ።
ar: ❌ خطأ في الشبكة أثناء بدء الدفع. يرجى التحقق من اتصالك والمحاولة مرة أخرى.
or: ❌ Yeroo kaffaltiin jalqabamu rakkoon marsariitii mudate. Walqunnamtii kee mirkaneessi itti deebi'i.

source: ❌ An unexpected error occurred while processing your payment. Please try again later.
am: ❌ ክፍያዎን በሚሰራበት ጊዜ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء معالجة دفعتك. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Yeroo kaffaltiin hojjatamaa jiru dogoggorri hin eegamne tokko mudate. Itti deebi’i yeroo biraa.

source: ⏰ Your VIP subscription will expire in less than {hours} hours ({expiry_date})! Don't lose access to exclusive features like city-based matching. Renew your VIP status now: /vip
am: ⏰ የቪአይፒ ምዝገባዎ ከ{hours} ሰዓታት ባነሰ ጊዜ ውስጥ ({expiry_date}) ያልቃል! እንደ ከተማ ላይ የተመሰረተ ተዛማጅነት ያሉ ልዩ ባህሪያትን እንዳያጡ። የቪአይፒ ደረጃዎን አሁን ያድሱ: /vip
ar: ⏰ اشتراكك في خدمة VIP سينتهي خلال أقل من {hours} ساعة ({expiry_date})! لا تفقد الوصول إلى الميزات الحصرية مثل المطابقة حسب المدينة. جدد حالة VIP الخاصة بك الآن: /vip
or: ⏰ Galmeen VIP kee sa’aatii {hours} keessatti ni xumurama ({expiry_date})! Amaloota adda addaa akka waliin walitti fidu magaalaa keessaa hin dhaban. Amma haaraa ta’i: /vip

source: 😔 Your VIP subscription has expired. You no longer have access to exclusive features. Renew your VIP access anytime to unlock all premium benefits: /vip
am: 😔 የቪአይፒ ምዝገባዎ አልቋል። ከዚህ በኋላ ልዩ ባህሪያት ላይ መድረስ አይችሉም። ሁሉንም ፕሪሚየም ጥቅሞችን ለመክፈት የቪአይፒ መዳረሻዎን በማንኛውም ጊዜ ያድሱ: /vip
ar: 😔 لقد انتهى اشتراكك في خدمة VIP. لم يعد لديك وصول إلى الميزات الحصرية. جدد وصولك إلى VIP في أي وقت لفتح جميع المزايا المتميزة: /vip
or: 😔 Galmeen VIP kee xumurameera. Amaloota addaa ammas hin argattu. Yeroo kamuu VIP haaraa taasifachuudhaan bu’aa dabalataa hunda banadhu: /vip

source: Bad Request: Invalid JSON
am: መጥፎ ጥያቄ: ልክ ያልሆነ JSON
ar: طلب سيء: JSON غير صالح

source: Bad Request: Missing tx_ref
am: መጥፎ ጥያቄ: tx_ref ጠፍቷል
ar: طلب سيء: tx_ref مفقود

source: Internal Server Error
am: የውስጥ ሰርቨር ስህተት
ar: خطأ في الخادم الداخلي

source: 🎉 Congratulations! Your 💎{plan_name}💎 VIP subscription has been activated! It will expire on **{expiry_date}**.
am: 🎉 እንኳን ደስ አለዎት! የእርስዎ 💎{plan_name}💎 ቪአይፒ ምዝገባ ገብሯል! በ**{expiry_date}** ያበቃል።
ar: 🎉 تهانينا! لقد تم تفعيل اشتراكك 💎{plan_name}💎 VIP! سينتهي في **{expiry_date}**.

source: Webhook received, but internal DB/VIP update failed.
am: ዌብሁክ ተቀብሏል፣ ነገር ግን የውስጥ DB/VIP ዝመና አልተሳካም።
ar: تم استلام الويب هوك، ولكن فشل تحديث قاعدة البيانات الداخلية/VIP.

source: Internal Server Error: Network issue with Chapa API
am: የውስጥ ሰርቨር ስህተት: ከቻፓ ኤፒአይ ጋር የአውታረ መረብ ችግር
ar: خطأ في الخادم الداخلي: مشكلة في الشبكة مع واجهة برمجة تطبيقات Chapa

source: Internal Server Error: Unexpected issue
am: የውስጥ ሰርቨር ስህተት: ያልተጠበቀ ችግር
ar: خطأ في الخادم الداخلي: مشكلة غير متوقعة

source: Webhook received and processed.
am: ዌብሁክ ተቀብሎ ተሰራ።
ar: تم استلام الويب هوك ومعالجته.

source: Preparing your invoice...
am: ደረሰኝዎ እየተዘጋጀ ነው...
ar: جاري إعداد فاتورتك...
or: Herrega kaffaltii kee qopheessaa jirra...

source: An error occurred: Invalid plan selected. Please try again.
am: ስህተት ተፈጥሯል: ልክ ያልሆነ እቅድ ተመርጧል። እባክዎ እንደገና ይሞክሩ።
ar: حدث خطأ: تم اختيار خطة غير صالحة. يرجى المحاولة مرة أخرى.
or: Dogoggorri mudate: karoora sirrii hin taane filatte. Itti deebi’i.

source: title_key
ar: مفتاح_العنوان

source: description_key
ar: مفتاح_الوصف

source: 💫 Your invoice for **{title}** is ready!
am: 💫 ለ**{title}** የእርስዎ ደረሰኝ ዝግጁ ነው!
ar: 💫 فاتورتك لـ **{title}** جاهزة!
or: 💫 Herrega kaffaltii **{title}** kee qophaa’eera!

source: Sorry, something went wrong while creating your invoice. Please try again later.
am: ይቅርታ፣ ደረሰኝዎን በሚፈጥሩበት ጊዜ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: عذرًا، حدث خطأ ما أثناء إنشاء فاتورتك. يرجى المحاولة مرة أخرى لاحقًا.
or: Dhifama, herrega kee qopheessuuf yaaluun rakkoon tokko mudate. Itti deebi’i yeroo biraa.

source: 🎉 Congratulations! Your 💎**{plan_name_display}**💎 VIP subscription has been activated! It will expire on **{expiry_date_for_display}**.
am: 🎉 እንኳን ደስ አለዎት! የእርስዎ 💎**{plan_name_display}**💎 ቪአይፒ ምዝገባ ገብሯል! በ**{expiry_date_for_display}** ያበቃል።
ar: 🎉 تهانينا! لقد تم تفعيل اشتراكك 💎**{plan_name_display}**💎 VIP! سينتهي في **{expiry_date_for_display}**.
or: 🎉 Baga gammaddan! Galmeen 💎**{plan_name_display}**💎 VIP kee hojiirra ooluu eegaleera! Guyyaa **{expiry_date_for_display}** irratti ni xumurama.

source: Thank you for your payment, but there was an issue granting your VIP access. Please contact support.
am: ለክፍያዎ እናመሰግናለን፣ ነገር ግን የቪአይፒ መዳረሻዎን በመስጠት ላይ ችግር ተፈጥሯል። እባክዎ ድጋፍን ያግኙ።
ar: شكرًا لك على دفعتك، ولكن كانت هناك مشكلة في منحك وصول VIP. يرجى الاتصال بالدعم.
or: Kaffaltii keetiif galatoomi, garuu VIP si taasifuun rakkoo qaba ture. Mee deeggarsa qunnamii.

source: An unexpected error occurred. Please try again later or contact support.
am: ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ ወይም ድጋፍን ያግኙ።
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بالدعم.
or: Dogoggorri hin eegamne tokko mudate. Itti deebi’i yeroo biraa yookaan deeggarsa qunnamii.

source: VIP
am: ቪአይፒ

source: ♂️ Male
or: ♂️ Dhiira

source: ♀️ Female
or: ♀️ Dubartii

source: ❌ An internal error occurred. Please try again.
or: ❌ Rakkoon keessaa tokko mudate. Mee irra deebi'ii yaali.

source: ❌ An internal error occurred. Please try again later.
or: ❌ Rakkoon keessaa tokko mudate. Itti-dabaluu yaali yeroo biraa.

source: Language set to **{lang}**.
or: Afaan **{lang}** jedhamee filatameera.

source: 👋 Welcome to the Anonymous Chat Bot! Let's get you set up. By using this bot, you confirm you're 18+ and agree to our Terms and Conditions (/privacy). Please select your gender:
or: 👋 Baga Nagaan Dhuftan Botii Marii Maqaa Hin Agarsiifneetti! Amma si qopheessina. Bot kana yoo fayyadamte, umrii kee waggaa 18 ol ta'uu fi seerota keenya (/privacy) waliin waliigaltee agarsiiftu. Saala kee filadhu:

source: 🔄 Select your new gender:
or: 🔄 Saala haarawaa filadhu:

source: Choose the gender you want to chat with:
or: Saala waliin haasawu barbaaddu filadhu:

source: ⏳ You are already in the search queue. Please wait for your current search to complete, or you can /stop.
or: ⏳ Amma dura teessoo barbaachisaa keessatti jirtu. Mee barbaacha dhumaatti eegii, yookaan /stop fayyadami.

source: Your partner has disconnected. Use /search to find a partner.
or: Hojii walqunnamtii waraan kee addaan cite. Walitti dhufeenya haaraa argachuuf /search fayyadami.

source: ✅ Partner found! Start chatting! /next — find a new partner /stop — stop this chat
or: ✅ Hirmaataa argatteetta! Haasawa eegali! /next — hirmaataa haaraa argadhu /stop — haasawa kana dhaabi

source: 😔 No partners found at the moment. Please try again later.
or: 😔 Ammaaf hirmaataan hin argamne. Itti-dabaluu yaali yeroo biraa.

source: ✅ Partner found! Start chatting! /next — new partner /stop — end chat
or: ✅ Hirmaataa argatteetta! Haasawa eegali! /next — hirmaataa haaraa /stop — haasawa dhaabi

source: You are not in an active chat. /search to find a partner.
or: Haasawa keessa hin jirtu. /search fayyadami hirmaataa barbaaduuf.

source: ✅ Your partner has stopped the chat. /search to find a new partner
or: ✅ Hirmaataan kee haasawa dhaabeera. Hirmaataa haaraa barbaaduuf /search fayyadami

source: 🔄 Change Gender
or: 🔄 Saala jijjiiri

source: 💰 You earned 10 credits! Your total credits: {new_credits}
or: 💰 Kireeditii 10 argatteetta! Waliigala kireeditii kee: {new_credits}

source: 🔍Searching for a partner...
or: 🔍Hirmaataa barbaadaa jira...

source: 😔 No users are currently available for chat. Removed from search queue.
or: 😔 Ammaaf namoonni haasawuuf hin jirani. Teessoo barbaachaa irraa haquu dandeenye.

source: <b>💎 Become a VIP User</b> Support the chat and unlock premium features instantly. <b>Choose your preferred payment method:</b>
or: <b>💎 Fayyadamaa VIP ta’i</b> Haasawa deeggaruufi amala gatii ol’aanaa banadhu. <b>Maloota kaffaltii filadhu:</b>

source: 💎 **VIP City Match Found!** You're now chatting with another **VIP** member in your city. /next — find a new partner /stop — end chat
or: 💎 **Waliin walitti dhufeenya magaalaa keessaa VIP argameera!** Amma miseensa **VIP** biroo waliin magaalaa kee keessa haasawaa jirta. /next — nama biraa barbaadi /stop — haasawa dhaabi

source: 🏙️ **City Match Found!** You're now chatting with someone in your city. /next — find a new partner /stop — end chat
or: 🏙️ **Nama magaalaa kee keessa jiru argatte!** Amma nama magaalaa kee keessa jiru waliin haasawaa jirta. /next — nama biraa barbaadi /stop — haasawa dhaabi

source: 👍 Good
or: 👍 Gaariidha

source: 👎 Bad
or: 👎 Hamaa

source: 🎉 Congratulations! Your 💎{plan_name}💎 VIP subscription has been activated! It will expire on **{expiry_date_display}**.
or: 🎉 Baga gammaddan! Galmeen 💎{plan_name}💎 VIP kee hojiirra ooluu eegaleera! Guyyaa **{expiry_date_display}** irratti ni xumurama.

source: ❌ We received your payment, but there was an issue activating your VIP status. Please contact support immediately.
or: ❌ Kaffaltii kee arganneerra, garuu VIP si taasifuun rakkoo qaba. Mee saffisaan deeggarsa qunnamii.

source: 😔 Your Chapa payment for {plan_name} failed. Please try again or contact support if you believe this is an error.
or: 😔 Kaffaltiin Chapa karoora {plan_name}f taasifame hin milkoofne. Itti deebi’i yookaan dogoggora ta’uu yoo yaadde deeggarsa qunnamii.
