Repository: abubeker0/salam
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: am, ar, or

source: 📍 Share Location
am: 📍 አካባቢን ያጋሩ
ar: 📍 مشاركة الموقع
or: 📍 Bakka Jirtu Qoodu

source: ⚠️ Your profile is incomplete. Please finish the setup. Select your gender:
am: ⚠️ የእርስዎ መገለጫ አልተጠናቀቀም። እባክዎ ማዋቀሩን ይጨርሱ። ጾታዎን ይምረጡ:
ar: ⚠️ ملفك الشخصي غير مكتمل. يرجى إتمام الإعداد. اختر جنسك:
or: ⚠️ Odeeffannoon ke hin guutamne. Mee qindaa'ina fixi. Saala kee filadhu:

source: 📍 Would you like to share your location for better matches? This is optional, but helps us find people near you. If not, use /search command to find a match.
am: 📍 ለተሻለ ተዛማጅነት አካባቢዎን ማጋራት ይፈልጋሉ? ይህ አማራጭ ነው፣ ነገር ግን በአቅራቢያዎ ያሉ ሰዎችን እንድናገኝ ይረዳናል። ካልሆነ፣ ተዛማጅ ለማግኘት /search ትዕዛዙን ይጠቀሙ።
ar: 📍 هل ترغب في مشاركة موقعك لمطابقات أفضل؟ هذا اختياري، ولكنه يساعدنا في العثور على أشخاص بالقرب منك. إذا لم يكن كذلك، استخدم أمر /search للعثور على مطابق.
or: 📍 Bakka jirtu qooduu barbaaddaa? Kun dirqama miti, garuu nama si bira jiru akka argannu nu gargaara. Yoo hin barbaadne, ajaja /search fayyadami.

source: 🎉 Welcome back! You're all set.
am: 🎉 እንኳን ደህና መጡ! ሁሉም ተዘጋጅቷል።
ar: 🎉 أهلاً بك مرة أخرى! كل شيء جاهز.
or: 🎉 Baga deebite! Hunduu siif qophaa’e.

source: ❌ An unexpected error occurred. Please try again later.
am: ❌ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Dogoggorri hin eegamne tokko mudate. Itti-dabaluu yaali yeroo biraa.

source: ⚠️ Could not detect your city. Please try again later.
am: ⚠️ ከተማዎን ማግኘት አልተቻለም። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ⚠️ لم نتمكن من تحديد مدينتك. يرجى المحاولة مرة أخرى لاحقًا.
or: ⚠️ Magaalaa kee arguu hin dandeenye. Itti-dabaluu yaali yeroo biraa.

source: ❌ An internal database error occurred while saving your location. Please try again.
am: ❌ አካባቢዎን ሲያስቀምጡ የውስጥ የመረጃ ቋት ስህተት ተፈጥሯል። እባክዎ እንደገና ይሞክሩ።
ar: ❌ حدث خطأ في قاعدة البيانات الداخلية أثناء حفظ موقعك. يرجى المحاولة مرة أخرى.
or: ❌ Rakkoon sirna keessaa yeroo bakka kee ol kaa'uufi mudate. Mee irra deebi'ii yaali.

source: ✅ Location set to: {city}
am: ✅ አካባቢ ወደ: {city} ተቀናብሯል።
ar: ✅ تم تعيين الموقع إلى: {city}

source: 👱‍♂️ Male
am: 👱‍♂️ ወንድ
ar: 👱‍♂️ ذكر

source: 👩‍🦰 Female
am: 👩‍🦰 ሴት
ar: 👩‍🦰 أنثى

source: Any
am: ማንኛውም
ar: أي
or: Kamiyyuu

source: Language set successfully!
am: ቋንቋ በተሳካ ሁኔታ ተቀናብሯል!
ar: تم تعيين اللغة بنجاح!
or: Afaan milkaa'inaan filatameera!

source: Language set to <b>{lang}</b>.
am: ቋንቋ ወደ <b>{lang}</b> ተቀናብሯል።
ar: تم تعيين اللغة إلى <b>{lang}</b>.

source: 👋 Welcome to the Selam Chat Bot! Let's get you set up. By using this bot, you confirm you're 18+ and agree to our Terms and Conditions (/privacy). Please select your gender:
am: 👋 ወደ ሰላም ቻት ቦት እንኳን ደህና መጡ! እናዋቅርዎት። ይህን ቦት በመጠቀም፣ 18+ እንደሆናችሁ እና የአገልግሎት ውላችንን (/privacy) እንደተስማማችሁ አረጋግጣችኋል። እባክዎ ጾታዎን ይምረጡ:
ar: 👋 مرحباً بك في بوت سلام للدردشة! لنقم بإعدادك. باستخدامك هذا البوت، فإنك تؤكد أنك تجاوزت 18 عامًا وتوافق على شروطنا وأحكامنا (/privacy). الرجاء تحديد جنسك:

source: ✅ Language updated successfully. You will only be matched with users who speak your language if possible.
am: ✅ ቋንቋ በተሳካ ሁኔታ ተዘምኗል። ከተቻለ ቋንቋዎን ከሚናገሩ ተጠቃሚዎች ጋር ብቻ ነው የሚገናኙት።
ar: ✅ تم تحديث اللغة بنجاح. ستتم مطابقتك فقط مع المستخدمين الذين يتحدثون لغتك إذا أمكن.

source: ❌ An unexpected error occurred. Please try again.
am: ❌ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.
or: ❌ Dogoggorri hin eegamne tokko mudate. Mee irra deebi’ii yaali.

source: Please choose your preferred language:
am: እባክዎ የሚመርጡትን ቋንቋ ይምረጡ:
ar: الرجاء اختيار لغتك المفضلة:

source: ❌ An error occurred.
am: ❌ ስህተት ተፈጥሯል።
ar: ❌ حدث خطأ.

source: ❌ Please try again later.
am: ❌ እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ يرجى المحاولة مرة أخرى لاحقًا.

source: ✅ Gender updated!
am: ✅ ጾታ ተዘምኗል!
ar: ✅ تم تحديث الجنس!
or: ✅ Saala kee haaromsiteetta!

source: 🔢 Please enter your age:
am: 🔢 እባክዎ ዕድሜዎን ያስገቡ:
ar: 🔢 الرجاء إدخال عمرك:
or: 🔢 Mee umrii kee galchi:

source: ❌ An unexpected error occurred while saving your gender. Please try again later.
am: ❌ ጾታዎን ሲያስቀምጡ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء حفظ جنسك. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Rakkoon hin eegamne yeroo saala kee ol kaa’uufi mudate. Itti-dabaluu yaali yeroo biraa.

source: ✅ Your profile is complete!
am: ✅ መገለጫዎ ተጠናቅቋል!
ar: ✅ ملفك الشخصي مكتمل!
or: ✅ Odeeffannoon kee guutamee jira!

source: ❌ An unexpected error occurred while saving your age. Please try again later.
am: ❌ ዕድሜዎን ሲያስቀምጡ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء حفظ عمرك. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Rakkoon hin eegamne yeroo umrii kee ol kaa’uufi mudate. Itti-dabaluu yaali yeroo biraa.

source: 👱‍♂️ Select your new gender👩‍🦰:
am: 👱‍♂️ አዲስ ጾታዎን ይምረጡ👩‍🦰:
ar: 👱‍♂️ اختر جنسك الجديد👩‍🦰:

source: 🙋🏻‍♂️ Male
am: 🙋🏻‍♂️ ወንድ
ar: 🙋🏻‍♂️ ذكر

source: 🙋🏻‍♀️ Female
am: 🙋🏻‍♀️ ሴት
ar: 🙋🏻‍♀️ أنثى

source: 🌐 Any
am: 🌐 ማንኛውም
ar: 🌐 أي

source: 💎Choose the gender you want to chat with:
am: 💎ለመወያየት የሚፈልጉትን ጾታ ይምረጡ:
ar: 💎اختر الجنس الذي تريد الدردشة معه:

source: ⏳ You are already in the search queue. Please wait for your current search to complete or /stop.
am: ⏳ አስቀድመው በፍለጋ ወረፋ ውስጥ ነዎት። እባክዎ የአሁኑ ፍለጋዎ እስኪያልቅ ወይም /stop እስኪሉ ድረስ ይጠብቁ።
ar: ⏳ أنت بالفعل في قائمة الانتظار. يرجى الانتظار حتى يكتمل بحثك الحالي أو استخدام /stop.

source: 😔Your partner has disconnected. Use /search to find a partner.
am: 😔 አጋርዎ ተቋርጧል። አጋር ለማግኘት /search ይጠቀሙ።
ar: 😔 شريكك قطع الاتصال. استخدم /search للعثور على شريك.

source: You were in a chat. Disconnected.
am: በውይይት ላይ ነበሩ። ግንኙነትዎ ተቋርጧል።
ar: كنت في محادثة. تم قطع الاتصال.
or: Waliin haasawaa turte. Walqunnamtiin addaan cite.

source: ⚠️ Could not retrieve your user info. Please try again.
am: ⚠️ የተጠቃሚ መረጃዎን ማግኘት አልተቻለም። እባክዎ እንደገና ይሞክሩ።
ar: ⚠️ تعذر استرداد معلومات المستخدم الخاصة بك. يرجى المحاولة مرة أخرى.
or: ⚠️ Odeeffannoo fayyadamaa kee arguu hin dandeenye. Mee irra deebi’ii yaali.

source: ⚠️ Please set your gender first using /setgender.
am: ⚠️ እባክዎ መጀመሪያ /setgender በመጠቀም ጾታዎን ያዘጋጁ።
ar: ⚠️ يرجى تعيين جنسك أولاً باستخدام /setgender.
or: ⚠️ Mee jalqaba saala kee /setgender fayyadamuun murteessi.

source: 💎 Gender-based matching is a VIP-only feature. Become a /vip member
am: 💎 በጾታ ላይ የተመሰረተ ተዛማጅነት የVIP አባላት ብቻ የሚያገኙት አገልግሎት ነው። /vip አባል ይሁኑ
ar: 💎 المطابقة القائمة على الجنس هي ميزة حصرية لكبار الشخصيات (VIP). كن عضوًا في /vip
or: 💎 Walitti-makuu saala irratti hundaa’e sadarkaa VIP qofatu fayyadama. /vip miseensa ta’i.

source: 🔍 Searching for a partner...
am: 🔍 አጋር በመፈለግ ላይ...
ar: 🔍 جاري البحث عن شريك...
or: 🔍 Hirmaataa barbaadaa jira...

source: 💎 You found another VIP partner! Start chatting! /next — find a new partner /stop — stop this chat
am: 💎 ሌላ ቪአይፒ አጋር አግኝተዋል! መወያየት ይጀምሩ! /next — አዲስ አጋር ይፈልጉ /stop — ይህን ውይይት ያቁሙ
ar: 💎 لقد وجدت شريك VIP آخر! ابدأ الدردشة! /next — ابحث عن شريك جديد /stop — أوقف هذه الدردشة
or: 💎 Hirmaataa VIP biraa argatteetta! Haasawa eegali! /next — hirmaataa haaraa argadhu /stop — haasawa kana dhaabi

source: ☺️ Partner found! Start chatting! /next — find a new partner /stop — stop this chat
am: ☺️ አጋር ተገኝቷል! መወያየት ይጀምሩ! /next — አዲስ አጋር ይፈልጉ /stop — ይህን ውይይት ያቁሙ
ar: ☺️ تم العثور على شريك! ابدأ الدردشة! /next — ابحث عن شريك جديد /stop — أوقف هذه الدردشة

source: 💎 VIP partner found! Start chatting! /next — find a new partner /stop — stop this chat
am: 💎 ቪአይፒ አጋር ተገኝቷል! መወያየት ይጀምሩ! /next — አዲስ አጋር ይፈልጉ /stop — ይህን ውይይት ያቁሙ
ar: 💎 تم العثور على شريك VIP! ابدأ الدردشة! /next — ابحث عن شريك جديد /stop — أوقف هذه الدردشة
or: 💎 Hirmaataa VIP argatteetta! Haasawa eegali! /next — hirmaataa haaraa argadhu /stop — haasawa kana dhaabi

source: ❌ An unexpected error occurred during search. Please try again later.
am: ❌ በፍለጋ ጊዜ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء البحث. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Dogoggorri hin eegamne yeroo barbaachaa keessa jiru mudate. Itti-dabaluu yaali yeroo biraa.

source: 🏙️ Search by City
am: 🏙️ በከተማ ይፈልጉ
ar: 🏙️ البحث حسب المدينة

source: 🙋🏻‍♂️ Search by Gender🙋🏻‍♀️
am: 🙋🏻‍♂️ በጾታ ይፈልጉ🙋🏻‍♀️
ar: 🙋🏻‍♂️ البحث حسب الجنس🙋🏻‍♀️

source: Please share your live location:
am: እባክዎ የቀጥታ አካባቢዎን ያጋሩ:
ar: الرجاء مشاركة موقعك المباشر:
or: Mee bakka jirtu yeroo dhugaa qoodi:

source: ⏳ You are already in the search queue. Please wait for your current search to complete, or you can /stop
am: ⏳ አስቀድመው በፍለጋ ወረፋ ውስጥ ነዎት። እባክዎ የአሁኑ ፍለጋዎ እስኪያልቅ ድረስ ይጠብቁ፣ ወይም /stop ማድረግ ይችላሉ።
ar: ⏳ أنت بالفعل في قائمة الانتظار. يرجى الانتظار حتى يكتمل بحثك الحالي، أو يمكنك استخدام /stop
or: ⏳ Amma dura teessoo barbaacha keessa jirtu. Mee dhumaatti eegii, yookaan /stop fayyadami.

source: 🤔 You are already in a dialog right now. /next — find a new partner /stop — stop this dialog
am: 🤔 በአሁኑ ጊዜ በውይይት ላይ ነዎት። /next — አዲስ አጋር ይፈልጉ /stop — ይህን ውይይት ያቁሙ
ar: 🤔 أنت بالفعل في محادثة الآن. /next — ابحث عن شريك جديد /stop — أوقف هذه المحادثة
or: 🤔 Amma keessa marii keessa jirtu. /next — hirmaataa haaraa argadhu /stop — marii kana dhaabi

source: 💎 You found another VIP partner! Start chatting! /next — new partner /stop — end chat
am: 💎 ሌላ ቪአይፒ አጋር አግኝተዋል! መወያየት ይጀምሩ! /next — አዲስ አጋር /stop — ውይይት ያቁሙ
ar: 💎 لقد وجدت شريك VIP آخر! ابدأ الدردشة! /next — شريك جديد /stop — إنهاء الدردشة
or: 💎 Hirmaataa VIP biraa argatteetta! Haasawa eegali! /next — hirmaataa haaraa /stop — haasawa dhaabi

source: ☺️ Partner found! Start chatting! /next — new partner /stop — end chat
am: ☺️ አጋር ተገኝቷል! መወያየት ይጀምሩ! /next — አዲስ አጋር /stop — ውይይት ያቁሙ
ar: ☺️ تم العثور على شريك! ابدأ الدردشة! /next — شريك جديد /stop — إنهاء الدردشة

source: 💎 VIP partner found! Start chatting! /next — new partner /stop — end chat
am: 💎 ቪአይፒ አጋር ተገኝቷል! መወያየት ይጀምሩ! /next — አዲስ አጋር /stop — ውይይት ያቁሙ
ar: 💎 تم العثور على شريك VIP! ابدأ الدردشة! /next — شريك جديد /stop — إنهاء الدردشة
or: 💎 Hirmaataa VIP argatteetta! Haasawa eegali! /next — hirmaataa haaraa /stop — haasawa dhaabi

source: 😔 Your partner has stopped the chat. /search to find a new partner
am: 😔 አጋርዎ ውይይቱን አቁሟል። አዲስ አጋር ለማግኘት /search ይጠቀሙ
ar: 😔 لقد أوقف شريكك الدردشة. استخدم /search للعثور على شريك جديد

source: How was your experience with your last partner?
am: ከመጨረሻው አጋርዎ ጋር ያለዎት ተሞክሮ እንዴት ነበር?
ar: كيف كانت تجربتك مع شريكك الأخير؟
or: Waliin taphataa dhumaati waliin turte akkam ture?

source: ✅ Chat stopped. /search to find a new partner
am: ✅ ውይይት ቆሟል። አዲስ አጋር ለማግኘት /search ይጠቀሙ
ar: ✅ تم إيقاف الدردشة. استخدم /search للعثور على شريك جديد
or: ✅ Haasawa dhaabbate. Hirmaataa haaraa barbaaduuf /search fayyadami

source: There was an issue stopping the chat.
am: ውይይቱን በማቆም ላይ ችግር ተፈጥሯል።
ar: حدثت مشكلة أثناء إيقاف الدردشة.
or: Haasawa dhaabuuf rakkoon tokko mudateera.

source: ✅ Your search has been stopped. /search to start again.
am: ✅ ፍለጋዎ ቆሟል። እንደገና ለመጀመር /search ይጠቀሙ።
ar: ✅ تم إيقاف بحثك. استخدم /search للبدء من جديد.

source: 🤔 You are not in an active chat or searching. /search to find a partner.
am: 🤔 በአሁኑ ጊዜ በውይይት ላይ አይደሉም ወይም እየፈለጉ አይደለም። አጋር ለማግኘት /search ይጠቀሙ።
ar: 🤔 أنت لست في محادثة نشطة أو لا تبحث حاليًا. استخدم /search للعثور على شريك.

source: 👱‍♂️Change Gender👩‍🦰
am: 👱‍♂️ጾታ ይቀይሩ👩‍🦰
ar: 👱‍♂️ تغيير الجنس👩‍🦰

source: 📍 Set Location
am: 📍 አካባቢ ያዘጋጁ
ar: 📍 تعيين الموقع
or: 📍 Bakka jiru kaa’i

source: 🎂 Set Age
am: 🎂 ዕድሜ ያዘጋጁ
ar: 🎂 تعيين العمر
or: 🎂 Umrii kaa’i

source: 🌐 Set Language
am: 🌐 ቋንቋ ያዘጋጁ
ar: 🌐 تعيين اللغة

source: ⚙️ Choose what you want to update:
am: ⚙️ ማዘመን የሚፈልጉትን ይምረጡ:
ar: ⚙️ اختر ما تريد تحديثه:
or: ⚙️ Wantoota haaromsu barbaaddu filadhu:

source: ❌ An unexpected error occurred while loading settings. Please try again later.
am: ❌ ቅንብሮችን በሚጫኑበት ጊዜ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء تحميل الإعدادات. يرجى المحاولة مرة أخرى لاحقًا.

source: 💰 You earned 20 credits! Your total credits: {new_credits}
am: 💰 20 ክሬዲት አግኝተዋል! ጠቅላላ ክሬዲትዎ: {new_credits}
ar: 💰 لقد ربحت 20 نقطة! إجمالي نقاطك: {new_credits}

source: ❌ An error occurred while adding credits. Please try again later.
am: ❌ ክሬዲቶችን ሲጨምሩ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ أثناء إضافة النقاط. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Kireeditii dabaluuf yaaluun dogoggora mudate. Itti deebi’i yeroo biraa.

source: Please wait for your previous search request to finish, or /stop to cancel.
am: እባክዎ የቀድሞው የፍለጋ ጥያቄዎ እስኪያልቅ ድረስ ይጠብቁ፣ ወይም ለመሰረዝ /stop ይጠቀሙ።
ar: الرجاء الانتظار حتى يكتمل طلب البحث السابق الخاص بك، أو استخدم /stop للإلغاء.
or: Mee barbaacha darbe dhumu eegii, yookaan /stop tuqii haquuf.

source: You have reached your daily search limit or have no credits. Use /credit to get more searches.
am: የእለታዊ ፍለጋ ገደብዎ ላይ ደርሰዋል ወይም ክሬዲት የለዎትም። ተጨማሪ ፍለጋዎችን ለማግኘት /credit ይጠቀሙ።
ar: لقد وصلت إلى الحد الأقصى اليومي للبحث أو ليس لديك نقاط. استخدم /credit للحصول على المزيد من عمليات البحث.
or: Daangaa barbaachaa guyyaa kee gaheerta yookaan kireeditii hin qabdu. /credit fayyadami barbaacha dabalataa argachuuf.

source: Your partner has disconnected to /search for someone new.
am: አጋርዎ ግንኙነቱን አቋርጧል፣ አዲስ ሰው ለመፈለግ /search ይጠቀሙ።
ar: لقد قطع شريكك الاتصال للبحث عن شخص جديد.
or: Hirmaataan kee addaan cite jira, nama haaraa barbaaduuf /search fayyadeera.

source: You have been disconnected from your previous chat. Searching for a new partner.
am: ከቀድሞው ውይይትዎ ግንኙነትዎ ተቋርጧል። አዲስ አጋር እየፈለግን ነው።
ar: لقد تم قطع اتصالك من محادثتك السابقة. جاري البحث عن شريك جديد.
or: Haasawa darbe irraa addaan citeetta. Hirmaataa haaraa barbaadaa jirta.

source: An internal error occurred. Please try again later.
am: የውስጥ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: حدث خطأ داخلي. يرجى المحاولة مرة أخرى لاحقًا.
or: Dogoggorri keessaa tokko mudate. Itti deebi’i yeroo biraa.

source: 🚫 You are banned until {banned_time}.
am: 🚫 እስከ {banned_time} ድረስ ታግደዋል።
ar: 🚫 أنت محظور حتى {banned_time}.
or: 🚫 Yeroo {banned_time} tti hanga ga’utti dhorkamteetta.

source: Your partner ended the chat. /search to find a new partner
am: አጋርዎ ውይይቱን አቁሟል። አዲስ አጋር ለማግኘት /search ይጠቀሙ።
ar: لقد أنهى شريكك الدردشة. استخدم /search للعثور على شريك جديد
or: Hirmaataan kee haasawa dhaabe. Hirmaataa haaraa barbaaduuf /search fayyadami

source: You're not currently in a chat.
am: በአሁኑ ጊዜ በውይይት ላይ አይደሉም።
ar: أنت لست في محادثة حاليًا.
or: Amma haasawa keessa hin jirtu.

source: ❌ An unexpected error occurred while retrieving the privacy policy. Please try again later.
am: ❌ የግላዊነት ፖሊሲውን በሚያገኙበት ጊዜ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء استرداد سياسة الخصوصية. يرجى المحاولة مرة أخرى لاحقًا.

source: 🎉 You already have 💎 **VIP access**! Enjoy all premium features.
am: 🎉 አስቀድመው 💎 **ቪአይፒ መዳረሻ** አለዎት! ሁሉንም ፕሪሚየም አገልግሎቶች ይደሰቱ።
ar: 🎉 لديك بالفعل وصول 💎 **VIP**! استمتع بجميع الميزات المتميزة.
or: 🎉 💎 **VIP seensa** duraan dursitee qabda! Amala addaa hunda fayyadami.

source: <b>💎 Become a VIP User</b> <b>🧭 Search in Your Own City</b> – Meet people nearby and spark local connections. <b>🚻 Gender-Based Searching</b> – Choose who you chat with. <b>⏳ Unlimited Searches</b> – No limits, keep exploring as much as you want. <b>🚫 Ad-Free Experience</b> – Enjoy chatting without any interruptions. <b>💎 Visible VIP Status</b> – Stand out with a special badge. <b>🤍 Support the Bot</b> – Help us grow and keep the service running. 👨🏻‍💻 If you have any questions, do not hesitate to get in touch @YourBotSupport <b>Choose your preferred payment method:</b>
am: <b>💎 ቪአይፒ ተጠቃሚ ይሁኑ</b> <b>🧭 በራስዎ ከተማ ይፈልጉ</b> – በአቅራቢያ ያሉ ሰዎችን ያግኙ እና የአካባቢ ግንኙነቶችን ይፍጠሩ። <b>🚻 በጾታ ላይ የተመሰረተ ፍለጋ</b> – ከማን ጋር መወያየት እንደሚፈልጉ ይምረጡ። <b>⏳ ያልተገደበ ፍለጋ</b> – ገደብ የለም፣ የፈለጉትን ያህል መፈለግዎን ይቀጥሉ። <b>🚫 ከማስታወቂያ ነጻ ተሞክሮ</b> – ያለ ምንም መቆራረጥ መወያየት ይደሰቱ። <b>💎 የሚታይ ቪአይፒ ሁኔታ</b> – በልዩ ባጅ ጎልተው ይታዩ። <b>🤍 ቦቱን ይደግፉ</b> – እንድናድግ እና አገልግሎቱን እንዲቀጥል ይረዱን። 👨🏻‍💻 ማንኛውም ጥያቄ ካለዎት፣ @YourBotSupport ላይ እኛን ለማግኘት አያመንቱ። <b>የሚመርጡትን የክፍያ ዘዴ ይምረጡ:</b>
ar: <b>💎 كن مستخدم VIP</b> <b>🧭 البحث في مدينتك</b> – قابل أشخاصًا قريبين منك وأنشئ اتصالات محلية. <b>🚻 البحث حسب الجنس</b> – اختر من تريد الدردشة معه. <b>⏳ بحث غير محدود</b> – لا توجد قيود، استمر في الاستكشاف بقدر ما تريد. <b>🚫 تجربة خالية من الإعلانات</b> – استمتع بالدردشة دون أي انقطاعات. <b>💎 حالة VIP مرئية</b> – تميز بشارة خاصة. <b>🤍 دعم البوت</b> – ساعدنا على النمو والحفاظ على استمرارية الخدمة. 👨🏻‍💻 إذا كان لديك أي أسئلة، فلا تتردد في التواصل معنا @YourBotSupport <b>اختر طريقة الدفع المفضلة لديك:</b>

source: 🧾 Telegram Payments
am: 🧾 ቴሌግራም ክፍያዎች
ar: 🧾 مدفوعات تيليجرام

source: 💳 Chapa Payments
am: 💳 ቻፓ ክፍያዎች
ar: 💳 مدفوعات تشابا

source: Your User ID is: `{user_id}`
am: የተጠቃሚ መታወቂያዎ: `{user_id}`
ar: معرف المستخدم الخاص بك هو: `{user_id}`
or: Teessoon Fayyadamaa Kee: `{user_id}`

source: ❌ An unexpected error occurred while retrieving your User ID. Please try again later.
am: ❌ የተጠቃሚ መታወቂያዎን በሚያገኙበት ጊዜ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء استرداد معرف المستخدم الخاص بك. يرجى المحاولة مرة أخرى لاحقًا.

source: ✅ Your age has been set to: **{age}**
am: ✅ ዕድሜዎ ወደ: **{age}** ተቀናብሯል
ar: ✅ تم تحديد عمرك إلى: **{age}**
or: ✅ Umrii kee akka **{age}** tti kaa’ameera

source: ❌ An error occurred while saving your age. Please try again later.
am: ❌ ዕድሜዎን ሲያስቀምጡ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ أثناء حفظ عمرك. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Dogoggorri umrii kee ol kaa'uuf yaaluun mudate. Itti deebi'i yeroo biraa.

source: ❌ Please enter a valid age between 10 and 100.
am: ❌ እባክዎ በ10 እና በ100 መካከል ትክክለኛ ዕድሜ ያስገቡ።
ar: ❌ الرجاء إدخال عمر صالح بين 10 و 100.
or: ❌ Mee umrii sirrii ta’e gidduu 10 fi 100 galchi.

source: ❌ Please enter a valid numeric age.
am: ❌ እባክዎ ትክክለኛ የቁጥር ዕድሜ ያስገቡ።
ar: ❌ الرجاء إدخال عمر رقمي صالح.
or: ❌ Mee lakkoofsa sirrii ta’e umrii agarsiisu galchi.

source: 💎 City-based matching is a **VIP-only feature**. Become a /vip member to unlock it!
am: 💎 በከተማ ላይ የተመሰረተ ተዛማጅነት **ለቪአይፒዎች ብቻ የሚገኝ ባህሪ** ነው። ለመክፈት /vip አባል ይሁኑ!
ar: 💎 المطابقة حسب المدينة هي ميزة **حصرية لكبار الشخصيات (VIP)**. كن عضوًا في /vip لفتحها!
or: 💎 Waliin walitti fiduun magaalaa tokko keessaa **ammaaf VIP qofaa**. /vip ta’i banuuf!

source: 📍 Please share your location first using the /setlocation command.
am: 📍 እባክዎ መጀመሪያ /setlocation ትዕዛዙን በመጠቀም አካባቢዎን ያጋሩ።
ar: 📍 الرجاء مشاركة موقعك أولاً باستخدام أمر /setlocation.
or: 📍 Mee dura iddoo ati jirtu /setlocation fayyadamuun qooduu.

source: ⚠️ You're already in a chat. Use /stop to end it first before searching.
am: ⚠️ አስቀድመው በውይይት ላይ ነዎት። ከመፈለግዎ በፊት ለማቆም /stop ይጠቀሙ።
ar: ⚠️ أنت بالفعل في محادثة. استخدم /stop لإنهاء المحادثة أولاً قبل البحث.
or: ⚠️ Amma haasawa keessa jirtu. Dura /stop fayyadami haasawa dhaabuuf.

source: ⏳ You're already searching. Please wait or use /stop to cancel.
am: ⏳ አስቀድመው እየፈለጉ ነው። እባክዎ ይጠብቁ ወይም ለመሰረዝ /stop ይጠቀሙ።
ar: ⏳ أنت بالفعل تبحث. يرجى الانتظار أو استخدام /stop للإلغاء.
or: ⏳ Amma barbaadaa jirta. Mee eegii yookaan /stop fayyadami haqii.

source: 🔍 Searching for a partner in your city...
am: 🔍 በከተማዎ ውስጥ አጋር በመፈለግ ላይ...
ar: 🔍 جاري البحث عن شريك في مدينتك...
or: 🔍 Hirmaataa magaalaa keeti keessa jiru barbaadaa jirta...

source: 💎 **VIP City Match Found!** You're now chatting with another **VIP** member in your city.
am: 💎 **የቪአይፒ ከተማ ተዛማጅ ተገኝቷል!** አሁን በከተማዎ ውስጥ ካለ ሌላ **ቪአይፒ** አባል ጋር እየተወያዩ ነው።
ar: 💎 **تم العثور على مطابق VIP في المدينة!** أنت الآن تدردش مع عضو **VIP** آخر في مدينتك.

source: 🏙️ **City Match Found!** You're now chatting with someone in your city.
am: 🏙️ **የከተማ ተዛማጅ ተገኝቷል!** አሁን በከተማዎ ውስጥ ካለ ሰው ጋር እየተወያዩ ነው።
ar: 🏙️ **تم العثور على مطابق في المدينة!** أنت الآن تدردش مع شخص في مدينتك.

source: 😔 No active users are available in your city right now. You'll stay in the search queue and be matched as soon as someone nearby becomes available.
am: 😔 በአሁኑ ጊዜ በከተማዎ ውስጥ ንቁ ተጠቃሚዎች የሉም። በፍለጋ ወረፋ ውስጥ ይቆያሉ እና በአቅራቢያ ያለ ሰው እንደተገኘ ይገናኛሉ።
ar: 😔 لا يوجد مستخدمون نشطون متاحون في مدينتك الآن. ستبقى في قائمة انتظار البحث وستتم مطابقتك بمجرد أن يصبح شخص قريب متاحًا.
or: 😔 Ammaaf namni magaalaa kee keessa jiru hin jiruu. Garuu teessoo barbaachaa keessa ni tura, nama dhihoo yeroo argamu si waliin walitti fiduuf.

source: ❌ An unexpected error occurred while searching for a city partner. Please try again later.
am: ❌ የከተማ አጋር ሲፈልጉ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء البحث عن شريك في المدينة. يرجى المحاولة مرة أخرى لاحقًا.
or: ❌ Dogoggorri hin eegamne tokko yeroo nama magaalaa keessaa barbaadu mudate. Itti deebi'i yeroo biraa.

source: 🤖 You're not in a chat right now. Tap /Search to start chatting.
am: 🤖 በአሁኑ ጊዜ በውይይት ላይ አይደሉም። ውይይት ለመጀመር /Search የሚለውን ይጫኑ።
ar: 🤖 أنت لست في محادثة الآن. اضغط /Search لبدء الدردشة.
or: 🤖 Amma haasawa keessa hin jirtu. /chat jalqabuuf /search tuqi.

source: ⚠️ Report
am: ⚠️ ሪፖርት
ar: ⚠️ إبلاغ
or: ⚠️ Himu

source: Your feedback has been submitted successfully.
am: ግብረመልስዎ በተሳካ ሁኔታ ቀርቧል።
ar: تم إرسال ملاحظاتك بنجاح.
or: Yaada keetiin milkaa’inaan ergameera.

source: ❌ An unexpected error occurred while submitting your feedback. Please try again later.
am: ❌ ግብረመልስዎን በሚያስገቡበት ጊዜ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء إرسال ملاحظاتك. يرجى المحاولة مرة أخرى لاحقًا.

source: 📢 Advertising
am: 📢 ማስታወቂያ
ar: 📢 إعلان
or: 📢 Beeksisaa

source: 💰 Selling
am: 💰 መሸጥ
ar: 💰 بيع
or: 💰 Gurgurtaa

source: 🔞 Child Pornography
am: 🔞 የህጻናት ወሲባዊ ምስሎች
ar: 🔞 مواد إباحية للأطفال
or: 🔞 Foddaa daa’imman ilaalchisee

source: 🤲 Begging
am: 🤲 መለመን
ar: 🤲 تسول
or: 🤲 Kadhannaa

source: 😡 Insult
am: 😡 ስድብ
ar: 😡 إهانة
or: 😡 Arrabsuu

source: 🪓 Violence
am: 🪓 ጥቃት
ar: 🪓 عنف
or: 🪓 Jeequmsa

source: 🌍 Racism
am: 🌍 ዘረኝነት
ar: 🌍 عنصرية
or: 🌍 Amala sanyii addaan baasu

source: 🤬 Vulgar Partner
am: 🤬 ብልግና አጋር
ar: 🤬 شريك بذيء
or: 🤬 Hirmaataa jechoota fokkataa jedhu

source: 🔙 Back
am: 🔙 ተመለስ
ar: 🔙 رجوع
or: 🔙 Deebi’i

source: ⚠️ Please select a reason to report your partner:
am: ⚠️ እባክዎ አጋርዎን ሪፖርት ለማድረግ ምክንያት ይምረጡ:
ar: ⚠️ الرجاء تحديد سبب للإبلاغ عن شريكك:
or: ⚠️ Mee hirmaataa kee himuuf sababaa filadhu:

source: ❌ An unexpected error occurred while showing report options. Please try again later.
am: ❌ የሪፖርት አማራጮችን በሚያሳዩበት ጊዜ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء عرض خيارات الإبلاغ. يرجى المحاولة مرة أخرى لاحقًا.

source: ✅ Your report has been submitted. Thank you!
am: ✅ ሪፖርትዎ ቀርቧል። እናመሰግናለን!
ar: ✅ تم إرسال بلاغك. شكراً لك!
or: ✅ Himannaa kee ergameera. Galatoomi!

source: ❌ An unexpected error occurred while submitting your report. Please try again later.
am: ❌ ሪፖርትዎን በሚያስገቡበት ጊዜ ያልተጠበቀ ስህተት ተፈጥሯል። እባክዎ ቆይተው እንደገና ይሞክሩ።
ar: ❌ حدث خطأ غير متوقع أثناء إرسال بلاغك. يرجى المحاولة مرة أخرى لاحقًا.

source: 100 ⭐ / $1.99 a week
am: 100 ⭐ / $1.99 በሳምንት
ar: 100 ⭐ / 1.99 دولار في الأسبوع
or: ⭐ 100 / $1.99 torbee tokkoof

source: 250 ⭐ / $3.99 a month
am: 250 ⭐ / $3.99 በወር
ar: 250 ⭐ / 3.99 دولار في الشهر
or: ⭐ 250 / $3.99 ji’a tokkoof

source: 1000 ⭐ / $19.99 a year
am: 1000 ⭐ / $19.99 በዓመት
ar: 1000 ⭐ / 19.99 دولار في السنة
or: ⭐ 1000 / $19.99 waggaa tokkoof

source: 💫 Choose your plan with Telegram Stars:
am: 💫 እቅድዎን በቴሌግራም ስታርስ ይምረጡ:
ar: 💫 اختر خطتك باستخدام نجوم تيليجرام:
or: 💫 Karoora kee Telegram Stars waliin filadhu:

source: 1 Month - 400 ETB
am: 1 ወር - 400 ብር
ar: شهر واحد - 400 إثيوبي بير
or: Ji’a 1 - 400 ETB

source: 6 Months - 1500 ETB
am: 6 ወር - 1500 ብር
ar: 6 أشهر - 1500 إثيوبي بير
or: Ji’a 6 - 1500 ETB

source: 1 Year - 2500 ETB
am: 1 ዓመት - 2500 ብር
ar: سنة واحدة - 2500 إثيوبي بير
or: Waggaa 1 - 2500 ETB

source: Choose your Chapa plan:
am: የቻፓ እቅድዎን ይምረጡ:
ar: اختر خطة Chapa الخاصة بك:
or: Karoora Chapa kee filadhu:

source: Invalid plan selected.
am: ትክክል ያልሆነ እቅድ ተመርጧል።
ar: تم اختيار خطة غير صالحة.
or: Karoora sirrii hin taane filatte.

source: Preparing Chapa payment...
am: የቻፓ ክፍያ በመዘጋጀት ላይ...
ar: جاري تحضير دفع Chapa...
or: Kaffaltii Chapa qopheessaa jirra...

source: VIP Subscription
am: ቪአይፒ የደንበኝነት ምዝገባ
ar: اشتراك VIP
or: Galmee VIP

source: Unlock VIP features in the bot
am: በቦቱ ውስጥ የቪአይፒ ባህሪያትን ይክፈቱ
ar: افتح ميزات VIP في البوت
or: Amaloota VIP keessatti banadhu
